import {FC} from 'react';
import Accordion from 'react-bootstrap/Accordion';
import image from "../../assets/Main.png";

export const FAQ: FC<{}> = () => {
    return (
        <div style={{ backgroundImage: `url(${image})`}} className="min-vh-100">
            <div className='container text-white p-5' >
           
            <Accordion defaultActiveKey="0" className='form text-white border'>
            <h2 className='text-center text-white p-2 m-2'>Поширені питання</h2>
        <Accordion.Item eventKey="0">
            <Accordion.Header className='bg-dark text-white'>Повітряна тривога</Accordion.Header>
            <Accordion.Body>
            <p>У випадку оголошення повітряної тривоги кінотеатр зупиняє поточні сеанси та проводить евакуацію гостей та працівників з кінотеатру до найближчого укриття.</p>
            <p>Якщо повітряна тривога триватиме менше 20 хвилин - сеанс буде відновлено. У випадку, якщо повітряна тривога триватиме більше 20 хвилин - сеанс відновленню не підлягає.</p>
            <p>Обміняти квитки придбані офлайн, можливо на касі кінотеатру відразу після завершення повітряної тривоги або впродовж 14 днів.</p>
            <p>Якщо ви купили квиток онлайн, вам автоматично будуть відправлені промокоди на наступний похід в кіно (на ту кількість та категорію місць, які були в замовленні) на електронну адресу вказану при оформленні.</p>
            </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item eventKey="1">
            <Accordion.Header>Вимкнення електроенергії під час сеансу</Accordion.Header>
            <Accordion.Body>
            <p>На жаль, наразі, графіки відключень для нас несподівані, як і для інших споживачів. </p>
            <p>
            Обміняти квитки придбані офлайн, можливо на касі кінотеатру відразу після ввімкення світла або впродовж 14 днів.
            Якщо ви купили квиток онлайн, вам автоматично будуть відправлені промокоди на наступний похід в кіно (на ту кількість та категорію місць, які були в замовленні) на електронну адресу вказану при оформленні.
            </p>
            </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item eventKey="2">
            <Accordion.Header>Як повернути замовлення</Accordion.Header>
            <Accordion.Body>
            <p>Під час військового стану кошти за квитки на рахунок не повертаються. При поверненні замовлення, тобі будуть надіслані промокоди на наступний похід в кіно на ту кількість та категорію місць, які були в замовленні. </p>
            <p>Промокод надійде на поштову скриньку, яку було вказано під час замовлення, одразу після оформлення запиту на повернення квитків. </p>
            </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item eventKey="3">
            <Accordion.Header>Як здійснити оплату</Accordion.Header>
            <Accordion.Body>
            <p>Ви можете провести оплату як онлайн так і в касі кінотеатру. Для оплати онлайн просто введи реквізити карти при купівлі на сайті чи в додатку. Для оплати в касі потрібно додати електронну карту в Apple Wallet або Android Wallet та щоб твій смартфон підтримував NFC.</p>
            </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item eventKey="4">
            <Accordion.Header>Чи можна обміняти квиток на іншу дату</Accordion.Header>
            <Accordion.Body>
            <p>Послуга обміну відсутня.</p>
            </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item eventKey="5">
            <Accordion.Header>Ціни та акції</Accordion.Header>
            <Accordion.Body>
            <p>Акції та знижки постійно оновлюються та можуть залежати від твого міста. Всі акції можна знайти во вкладці "Акції та знижки"</p>
            </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item eventKey="6">
            <Accordion.Header>3D-окуляри</Accordion.Header>
            <Accordion.Body>
            <p>Для перегляду фільму в 3D потрібно взяти свої або придбати особисті 3D-окуляри. Вони продаються онлайн або в касах кінотеатру разом з квитками. Вартість окулярів - 25 грн. Окуляри залишаться у тебе, тому їх можна буде використовувати і для наступних візитів. Є два розміри персональних 3D-окулярів: дорослі та дитячі. </p>
            </Accordion.Body>
        </Accordion.Item>
        <Accordion.Item eventKey="7">
            <Accordion.Header>Оренда кінозалу</Accordion.Header>
            <Accordion.Body>
            <p>Ти можеш орендувати кінозал для приватного перегляду, проведення презентацій, організації приватних вечірок або яскравих фотосесій. Додаткову інформацію можна отримати у менеджера конкретного кінотеатру або звернувшись до служби підтримки через форму зворотнього зв’язку.</p>
            </Accordion.Body>
        </Accordion.Item>
    </Accordion>
        </div>
        </div>   
    )
}